{
  "concept": "impressionism",
  "domain": "art",
  "abstraction_level": 3,
  "corpus": [
    {
      "compression_level": 0,
      "text": "capturing light's moment",
      "probes": {
        "recall": "Impressionism focuses on capturing...",
        "application": "Why did Impressionists paint outdoors?",
        "transfer": "How is Impressionist music similar to Impressionist painting?",
        "counterfactual": "Without changing light, would Impressionism exist?"
      },
      "expected_keywords": [
        "light",
        "moment"
      ]
    },
    {
      "compression_level": 1,
      "text": "painting fleeting light and color impressions",
      "probes": {
        "recall": "What do Impressionist painters try to capture?",
        "application": "Identify Impressionist qualities in Monet's Water Lilies.",
        "transfer": "How do photographers achieve 'impressionistic' effects?",
        "counterfactual": "If cameras existed earlier, would Impressionism develop differently?"
      },
      "expected_keywords": [
        "light",
        "color",
        "impressions"
      ]
    },
    {
      "compression_level": 2,
      "text": "Impressionism: art movement emphasizing light, color, and momentary visual sensations over detailed realism. Quick brushstrokes capture changing conditions.",
      "probes": {
        "recall": "Describe Impressionist painting techniques.",
        "application": "Why do Impressionist paintings look 'blurry' up close but clear from distance?",
        "transfer": "How did Impressionism influence modern graphic design?",
        "counterfactual": "If Impressionists valued detail over light, what would change?"
      },
      "expected_keywords": [
        "light",
        "momentary",
        "brushstrokes",
        "visual sensation"
      ]
    },
    {
      "compression_level": 3,
      "text": "Impressionism was a 19th-century art movement emphasizing accurate depiction of light and its changing qualities. Characteristics: visible brushstrokes, open composition, emphasis on light's effects, ordinary subjects, unusual visual angles. Artists painted en plein air to capture momentary effects. Rejected academic tradition's emphasis on historical subjects and precise detail.",
      "probes": {
        "recall": "What techniques distinguish Impressionist paintings?",
        "application": "Analyze how Renoir's 'Luncheon of the Boating Party' shows Impressionist principles.",
        "transfer": "How did Japanese woodblock prints influence Impressionism?",
        "counterfactual": "If the Salon had accepted Impressionist work, how would art history change?"
      },
      "expected_keywords": [
        "light qualities",
        "brushstrokes",
        "plein air",
        "momentary",
        "academic tradition"
      ]
    },
    {
      "compression_level": 4,
      "text": "Impressionism emerged in 1860s France as radical departure from academic painting. Core principles: (1) Light and color primacy - captured changing light conditions, shadows with color not black, (2) Broken color technique - unmixed colors placed side-by-side, optical mixing by viewer's eye, (3) Visible brushwork - short, broken strokes convey movement and vitality, (4) En plein air painting - outdoor work to observe light directly, (5) Modern life subjects - cafes, railways, suburban leisure vs historical/mythological themes. Key artists: Monet (serial paintings of haystacks, cathedrals), Renoir (dappled light through trees), Degas (unusual angles, movement), Pissarro (rural scenes). Named from Monet's 'Impression, Sunrise' (1872), initially derogatory. Influences: photography (spontaneity), Japanese prints (cropping, flatness), scientific color theory (Chevreul). Opposition: Salon rejected for 'unfinished' appearance. Legacy: liberated color from description, emphasized perception over representation, opened path to Post-Impressionism, Fauvism, Abstract art. Neo-Impressionism (Seurat) systematized color theory into Pointillism.",
      "probes": {
        "recall": "Provide a comprehensive explanation of Impressionism.",
        "application": "Compare early vs late Monet to show evolution of Impressionist style.",
        "transfer": "How do video games use Impressionist principles in environmental design?",
        "counterfactual": "In a world without industrialization, could Impressionism have emerged?"
      },
      "expected_keywords": [
        "plein air",
        "broken color",
        "optical mixing",
        "Monet",
        "light conditions",
        "academic painting"
      ]
    }
  ]
}
