{
  "concept": "harm_principle",
  "domain": "ethics",
  "abstraction_level": 4,
  "corpus": [
    {
      "compression_level": 0,
      "text": "liberty unless harm",
      "probes": {
        "recall": "The harm principle limits actions when...",
        "application": "Can society ban dangerous sports under this principle?",
        "transfer": "How does this apply to hate speech regulation?",
        "counterfactual": "Without the harm principle, how would laws differ?"
      },
      "expected_keywords": [
        "liberty",
        "harm"
      ]
    },
    {
      "compression_level": 1,
      "text": "restrict actions only to prevent harm to others",
      "probes": {
        "recall": "When can individual freedom be limited?",
        "application": "Should seatbelt laws exist under the harm principle?",
        "transfer": "Apply this to environmental regulations.",
        "counterfactual": "What if 'harm' included offense or discomfort?"
      },
      "expected_keywords": [
        "restrict",
        "harm",
        "others"
      ]
    },
    {
      "compression_level": 2,
      "text": "Mill's principle: Individual liberty limited only when actions harm others, not for person's own good.",
      "probes": {
        "recall": "What does Mill say about paternalistic laws?",
        "application": "Analyze drug prohibition through this lens.",
        "transfer": "How does this relate to positive vs negative liberty?",
        "counterfactual": "If self-harm affected society indirectly, would Mill's principle apply?"
      },
      "expected_keywords": [
        "Mill",
        "liberty",
        "harm others",
        "own good"
      ]
    },
    {
      "compression_level": 3,
      "text": "John Stuart Mill's harm principle: Actions should only be restricted to prevent harm to others. Self-regarding actions are protected from interference. Distinguishes harm to others (legitimate restriction) from self-harm or offense (not legitimate). Foundational to liberalism.",
      "probes": {
        "recall": "What types of harm justify restricting liberty?",
        "application": "Should vaccine mandates be allowed under this principle?",
        "transfer": "Compare Mill's harm principle to Kant's categorical imperative.",
        "counterfactual": "In a collectivist society, would the harm principle make sense?"
      },
      "expected_keywords": [
        "Mill",
        "restrict",
        "harm to others",
        "self-regarding",
        "liberalism"
      ]
    },
    {
      "compression_level": 4,
      "text": "John Stuart Mill's harm principle from 'On Liberty' (1859) states that individual actions should only be limited by society to prevent harm to others. Core tenets: (1) Self-regarding actions - those affecting only oneself - should never be restricted even if harmful to the individual, (2) Other-regarding actions can be restricted only to prevent direct harm to others, (3) Mere offense, disgust, or moral disapproval don't constitute 'harm', (4) Competent adults are best judges of their own interests. Implications: opposes paternalistic laws (seatbelts, drugs), supports free speech even if offensive, permits any consensual adult behavior. Challenges: defining 'harm' (physical only? economic? psychological?), indirect effects (do all actions affect others?), children and incompetent persons exempt. Central to liberal political philosophy, influenced First Amendment jurisprudence, debates on victimless crimes. Critics argue it's too individualistic, ignores social nature of humans.",
      "probes": {
        "recall": "Explain Mill's harm principle comprehensively.",
        "application": "Analyze COVID mask mandates using the harm principle.",
        "transfer": "How does the harm principle relate to modern debates on platform content moderation?",
        "counterfactual": "If Mill included 'harm to society's moral fabric,' how would applications change?"
      },
      "expected_keywords": [
        "John Stuart Mill",
        "On Liberty",
        "self-regarding",
        "other-regarding",
        "paternalism",
        "liberal philosophy"
      ]
    }
  ]
}
