{
  "concept": "impressionism",
  "domain": "art_history",
  "abstraction_level": 2,
  "corpus": [
    {
      "compression_level": 0,
      "text": "fleeting light perception",
      "probe_question": "What is impressionism?",
      "expected_keywords": [
        "fleeting",
        "light",
        "perception"
      ]
    },
    {
      "compression_level": 1,
      "text": "fleeting light perception in landscapes",
      "probe_question": "Describe impressionism briefly",
      "expected_keywords": [
        "light",
        "perception",
        "landscapes",
        "fleeting"
      ]
    },
    {
      "compression_level": 2,
      "text": "Impressionism captures fleeting light perception in landscapes, using quick brushstrokes and bright colors to show momentary effects. This approach challenged traditional realism and influenced modern art’s focus on experience.",
      "probe_question": "Explain impressionism",
      "expected_keywords": [
        "impressionism",
        "fleeting light",
        "brushstrokes",
        "bright colors",
        "realism",
        "modern art"
      ]
    },
    {
      "compression_level": 3,
      "text": "Impressionism is an art movement that emerged in 19th-century France, emphasizing the depiction of transient light and atmosphere in outdoor scenes. Artists like Claude Monet and Pierre-Auguste Renoir used visible, rapid brushstrokes and vibrant, unmixed colors to convey immediacy and sensory experience. Rejecting academic realism, Impressionists pioneered plein air painting and foregrounded subjective perception, profoundly shaping the evolution of modern art.",
      "probe_question": "Provide a detailed explanation of impressionism",
      "expected_keywords": [
        "impressionism",
        "19th-century france",
        "transient light",
        "outdoor scenes",
        "monet",
        "renoir",
        "plein air",
        "modern art"
      ]
    },
    {
      "compression_level": 4,
      "text": "Impressionism is an influential 19th-century art movement originating in France, characterized by its focus on capturing the fleeting effects of light, atmosphere, and movement. Rejecting academic conventions, Impressionist artists such as Claude Monet, Pierre-Auguste Renoir, and Edgar Degas employed loose, visible brushstrokes, vibrant color palettes, and open compositions to depict contemporary life and landscapes. Key principles include painting en plein air (outdoors), emphasizing sensory experience over precise detail, and representing transient moments rather than static subjects. Impressionism revolutionized artistic practice by prioritizing subjective perception and optical phenomena, laying the groundwork for modern art. Its applications extend beyond painting to sculpture, printmaking, and even music, influencing subsequent movements like Post-Impressionism and inspiring innovations in technique, composition, and the portrayal of everyday scenes. Impressionism remains pivotal in art history for its radical approach to representation and its enduring impact on visual culture.",
      "probe_question": "Provide a comprehensive explanation of impressionism",
      "expected_keywords": [
        "impressionism",
        "france",
        "light",
        "movement",
        "monet",
        "renoir",
        "degas",
        "brushstrokes",
        "en plein air",
        "modern art",
        "post-impressionism",
        "visual culture"
      ]
    }
  ]
}