{
  "concept": "natural_selection",
  "domain": "biology",
  "abstraction_level": 3,
  "corpus": [
    {
      "compression_level": 0,
      "text": "survival advantage",
      "probe_question": "What is natural_selection?",
      "expected_keywords": [
        "survival",
        "advantage",
        "adaptation"
      ]
    },
    {
      "compression_level": 1,
      "text": "survival advantage passed to offspring",
      "probe_question": "Describe natural_selection briefly",
      "expected_keywords": [
        "survival",
        "advantage",
        "offspring",
        "inheritance"
      ]
    },
    {
      "compression_level": 2,
      "text": "Natural selection means individuals with helpful traits are more likely to survive and reproduce, passing those traits to offspring. Over time, this shapes populations to better fit their environments.",
      "probe_question": "Explain natural_selection",
      "expected_keywords": [
        "natural selection",
        "helpful traits",
        "survive",
        "reproduce",
        "populations",
        "environments"
      ]
    },
    {
      "compression_level": 3,
      "text": "Natural selection is a fundamental mechanism of evolution where organisms with advantageous adaptations—such as camouflage or disease resistance—have higher fitness, meaning they survive and reproduce more successfully. These beneficial alleles become more common in the gene pool over generations. For example, peppered moths in polluted areas evolved darker coloration, better matching their environment and avoiding predators. This process drives populations to become better suited to their ecological niches.",
      "probe_question": "Provide a detailed explanation of natural_selection",
      "expected_keywords": [
        "natural selection",
        "evolution",
        "adaptations",
        "fitness",
        "gene pool",
        "alleles",
        "camouflage",
        "ecological niches"
      ]
    },
    {
      "compression_level": 4,
      "text": "Natural selection is a fundamental mechanism of evolution in biology, whereby heritable traits that confer a survival or reproductive advantage become more common in a population over successive generations. It operates on genetic variation within populations, which arises from mutations, genetic recombination, and other sources. The key principles of natural selection include variation (individuals differ in traits), differential survival and reproduction (some traits enhance fitness), and heredity (advantageous traits are passed to offspring). Over time, natural selection can lead to adaptation, where populations become better suited to their environments. This process explains phenomena such as antibiotic resistance in bacteria, the development of camouflage in animals, and the diversification of species. Natural selection is central to fields like evolutionary biology, ecology, and conservation, providing a scientific framework for understanding the origin and maintenance of biological diversity.",
      "probe_question": "Provide a comprehensive explanation of natural_selection",
      "expected_keywords": [
        "natural selection",
        "evolution",
        "heritable traits",
        "genetic variation",
        "adaptation",
        "survival advantage",
        "reproduction",
        "mutations",
        "fitness",
        "species diversification",
        "antibiotic resistance",
        "biological diversity"
      ]
    }
  ]
}