{
  "concept": "phoneme",
  "domain": "linguistics",
  "abstraction_level": 4,
  "corpus": [
    {
      "compression_level": 0,
      "text": "distinctive speech sound",
      "probe_question": "What is phoneme?",
      "expected_keywords": [
        "distinctive",
        "speech",
        "sound"
      ]
    },
    {
      "compression_level": 1,
      "text": "distinctive speech sound in language",
      "probe_question": "Describe phoneme briefly",
      "expected_keywords": [
        "speech sound",
        "language",
        "distinctive",
        "phoneme"
      ]
    },
    {
      "compression_level": 2,
      "text": "A phoneme is a distinctive speech sound in language that can change word meaning; understanding phonemes helps explain how languages organize sounds and how people distinguish words when speaking.",
      "probe_question": "Explain phoneme",
      "expected_keywords": [
        "phoneme",
        "speech sound",
        "word meaning",
        "language",
        "organize sounds",
        "distinguish words"
      ]
    },
    {
      "compression_level": 3,
      "text": "A phoneme is the smallest unit of sound in a language that can distinguish meaning between words, such as /p/ and /b/ in \"pat\" versus \"bat.\" Phonemes are abstract representations, realized as different allophones depending on context. Linguists analyze phoneme inventories to compare languages and study language acquisition, while speech recognition technology relies on accurate phoneme identification to process spoken input.",
      "probe_question": "Provide a detailed explanation of phoneme",
      "expected_keywords": [
        "phoneme",
        "sound unit",
        "meaning distinction",
        "allophones",
        "phoneme inventory",
        "language acquisition",
        "linguists",
        "speech recognition"
      ]
    },
    {
      "compression_level": 4,
      "text": "A phoneme is the smallest distinctive unit of sound in a language that serves to differentiate meaning between words. In linguistics, phonemes are abstract representations of speech sounds, and each language has its own inventory of phonemes. Key principles include minimal pairs—words that differ by only one phoneme, such as \"bat\" and \"pat\"—which demonstrate the contrastive function of phonemes. Phonemes are realized as phones, their actual spoken variants, and may have multiple allophones depending on phonological context. The identification and analysis of phonemes are central to phonology, aiding in the description of sound systems and the development of writing systems, such as alphabetic orthographies. Applications extend to language teaching, speech recognition, and linguistic fieldwork, where understanding phonemic distinctions is crucial for accurate transcription and analysis of languages.",
      "probe_question": "Provide a comprehensive explanation of phoneme",
      "expected_keywords": [
        "phoneme",
        "speech sounds",
        "minimal pairs",
        "contrastive function",
        "phones",
        "allophones",
        "phonological context",
        "phonology",
        "sound systems",
        "writing systems",
        "language teaching",
        "transcription"
      ]
    }
  ]
}